# PhyMaterialParamMinimumTensileStrength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamMinimumTensileStrength Property
ParameterTypeId Class See Also
---
"Minimum tensile strength"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamMinimumTensileStrength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamMinimumTensileStrength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamMinimumTensileStrength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace